○ One model should use client IP to predict the country from which the request originated. You can use any model you want but you should be able to achieve at least 99% accuracy for this exercise.

○ The second model should use any of the available fields to predict income. Once again you get to choose what kind of model you want to use. You should aim for 80+% accuracy for this second model but report any problems you run into, as fitting a model for this data is subject to the vagaries of the random seed you may have picked.

In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import csv

In [11]:
requests = pd.read_csv('requests.csv')
requests.head()

,Row,Country,Gender,Age,Income,Client_Ip,Date
0,1,Venezuela,Female,0-16,10k-20k,11.128.127.220,10/29/23 2:00
1,2,Venezuela,Female,0-16,10k-20k,11.128.127.220,10/29/23 2:00
2,3,Qatar,Male,46-55,20k-40k,96.212.217.245,10/29/23 9:00
3,4,Qatar,Male,46-55,20k-40k,96.212.217.245,10/29/23 9:00
4,5,Trinidad and Tobago,Male,17-25,60k-100k,149.121.160.201,10/29/23 16:00

In [12]:
failure = pd.read_csv('failure.csv')
failure.head()

   Row            Date       File  Status
0    1  10/29/23 20:00  4511.html     200
1    2  10/29/23 20:00  4511.html     200
2    3  10/29/23 15:00  3339.html     400
3    4  10/29/23 15:00  3339.html     400
4    5   10/29/23 8:00  4171.html     200

In [18]:
# cleaning data, normalization, encoding, removing useless columns
# drop rows with missing values
requests = requests.dropna()
failure = failure.dropna()

In [22]:
# we dont need the row number and date
# requests = requests.drop(['Row', 'Date'], axis=1)

failure = failure.drop(['Row', 'Date'], axis=1)

In [23]:
requests.head()

               Country  Gender    Age    Income        Client_Ip
0            Venezuela  Female   0-16   10k-20k   11.128.127.220
1            Venezuela  Female   0-16   10k-20k   11.128.127.220
2                Qatar    Male  46-55   20k-40k   96.212.217.245
3                Qatar    Male  46-55   20k-40k   96.212.217.245
4  Trinidad and Tobago    Male  17-25  60k-100k  149.121.160.201

In [24]:
failure.head()

        File  Status
0  4511.html     200
1  4511.html     200
2  3339.html     400
3  3339.html     400
4  4171.html     200